app/controllers/events_controller.rb

  def index
    render json: Event.all
---
SELECT `events`.* FROM `events`

  def show
    render json: Event.find(params[:id])
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1

  def create
    event = Event.new(event_params)
    if event.save
---
INSERT INTO `events` (`name`, `start`, `end`, `created_at`, `updated_at`) VALUES ('curlから作成した予定', '2020-10-11 01:00:00', '2020-10-11 02:00:00', '2021-12-08 23:33:51.812075', '2021-12-08 23:33:51.812075')

  def update
    event = Event.find(params[:id])
    if event.update(event_params)
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 5 LIMIT 1
UPDATE `events` SET `events`.`name` = 'curlから更新した予定', `events`.`updated_at` = '2021-12-08 23:40:45.949426' WHERE `events`.`id` = 5

  def destroy
    event = Event.find(params[:id])
    event.destroy!
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 5 LIMIT 1
DELETE FROM `events` WHERE `events`.`id` = 5